Revit 2027 API
DockablePaneState.FloatingRectangle Property
 When %dockPosition% is Floating, this rectangle determines the size and position of the pane. Coordinates are relative to the upper-left-hand corner of the main Revit window. Note: the returned Rectangle is a copy. In order to change the pane state, you must call SetFloatingRectangle with a modified rectangle.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Rectangle FloatingRectangle { get; }
Public ReadOnly Property FloatingRectangle As Rectangle
	Get
public:
property Rectangle^ FloatingRectangle {
	Rectangle^ get ();
}
member FloatingRectangle : Rectangle with get
Property Value
Rectangle
See Also
Reference
DockablePaneState Class
Autodesk.Revit.UI Namespace